In [1]:
import pandas as pd

In [2]:
sample_dict = {
    "code" : [8876, 5543, 7846, 2395],
    "quantity" : [1, 22, 4, 6],
    "price" : [0.5, 0.25, 1.99, 0.3]
}

In [5]:
df = pd.DataFrame(sample_dict)
df.head(2)

   code  quantity  price
0  8876         1   0.50
1  5543        22   0.25

In [6]:
import seaborn as sns

In [9]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [16]:
df[df["age"] >= 18]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
print(f"Number of kids onboard: {len(df[df["age"] < 18])}")

Number of kids on board: 113

In [18]:
print(f"Number of adultd onboard: {len(df[df["age"] >= 18])}")

Number of adultd onboard: 601

In [29]:
df_adults =df[df["age"].between(18, 45)]
df_adults.reset_index(drop=True, inplace=True)

In [31]:
df_adults.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [33]:
df["embark_town"].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [56]:
# Adult, Male, Fare >= average, embarked from either Southampton or Queenstown
df[(df["sex"] == "male") & (df["age"].between(18, 45)) & (df["fare"] > df["fare"].mean()) & (df["embark_town"].isin(["Southampton", "Queenstown"])) & (df["sibsp"] == 0) & (df["class"] == "First") & (df["alive"] == "yes")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
23,1,1,male,28.0,0,0,35.5,S,First,man,True,A,Southampton,yes,True